{
  "MSFT": {
    "symbol": "MSFT",
    "name": "Microsoft Corporation",
    "sector": "Technology",
    "industry": "Software - Infrastructure",
    "market_cap": 3748250255360,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.microsoft.com",
    "description": "Microsoft Corporation develops and supports software, services, devices, and solutions worldwide. The company's Productivity and Business Processes segment offers Microsoft 365 Commercial, Enterprise Mobility + Security, Windows Commercial, Power BI, Exchange, SharePoint, Microsoft Teams, Security and Compliance, and Copilot; Microsoft 365 Commercial products, such as Windows Commercial on-premises and Office licensed services; Microsoft 365 Consumer products and cloud services, such as Microsoft 365 Consumer subscriptions, Office licensed on-premises, and other consumer services; LinkedIn; Dynamics products and cloud services, such as Dynamics 365, cloud-based applications, and on-premises ERP and CRM applications. Its Intelligent Cloud segment provides Server products and cloud services, such as Azure and other cloud services, GitHub, Nuance Healthcare, virtual desktop offerings, and other cloud services; Server products, including SQL and Windows Server, Visual Studio and System Cen",
    "cached_at": "2025-08-25T15:01:36.202563"
  },
  "META": {
    "symbol": "META",
    "name": "Meta Platforms, Inc.",
    "sector": "Communication Services",
    "industry": "Internet Content & Information",
    "market_cap": 1892394991616,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://investor.atmeta.com",
    "description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality and mixed reality headsets, augmented reality, and wearables worldwide. It operates through two segments, Family of Apps (FoA) and Reality Labs (RL). The FoA segment offers Facebook, which enables people to build community through feed, reels, stories, groups, marketplace, and other; Instagram that brings people closer through instagram feed, stories, reels, live, and messaging; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; Threads, an application for text-based updates and public conversations; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact in a private way. The RL segment provides virtual, augmented, and mixed reality rel",
    "cached_at": "2025-08-25T15:01:36.368549"
  },
  "AAPL": {
    "symbol": "AAPL",
    "name": "Apple Inc.",
    "sector": "Technology",
    "industry": "Consumer Electronics",
    "market_cap": 3371145363456,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.apple.com",
    "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription ",
    "cached_at": "2025-08-25T15:01:36.409512"
  },
  "GOOGL": {
    "symbol": "GOOGL",
    "name": "Alphabet Inc.",
    "sector": "Communication Services",
    "industry": "Internet Content & Information",
    "market_cap": 2524939026432,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://abc.xyz",
    "description": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers AI infrastructure, Vertex AI platform, cybersecurity, data and analytics, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The ",
    "cached_at": "2025-08-25T15:01:36.428250"
  },
  "AMZN": {
    "symbol": "AMZN",
    "name": "Amazon.com, Inc.",
    "sector": "Consumer Cyclical",
    "industry": "Internet Retail",
    "market_cap": 2430957256704,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.aboutamazon.com",
    "description": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, fire tablets, fire TVs, echo, ring, blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's prod",
    "cached_at": "2025-08-25T15:01:36.442706"
  },
  "TSLA": {
    "symbol": "TSLA",
    "name": "Tesla, Inc.",
    "sector": "Consumer Cyclical",
    "industry": "Auto Manufacturers",
    "market_cap": 1117941006336,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.tesla.com",
    "description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generatio",
    "cached_at": "2025-08-25T15:01:36.809854"
  },
  "NVDA": {
    "symbol": "NVDA",
    "name": "NVIDIA Corporation",
    "sector": "Technology",
    "industry": "Semiconductors",
    "market_cap": 4385134346240,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.nvidia.com",
    "description": "NVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment includes its Data Centre accelerated computing platforms and artificial intelligence solutions and software; networking; automotive platforms and autonomous and electric vehicle solutions; Jetson for robotics and other embedded platforms; and DGX Cloud computing services. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating industrial AI and digital twin applications. It also customized agentic solutions designed in collaboration",
    "cached_at": "2025-08-25T15:01:37.003609"
  },
  "JPM": {
    "symbol": "JPM",
    "name": "JPMorgan Chase & Co.",
    "sector": "Financial Services",
    "industry": "Banks - Diversified",
    "market_cap": 810901241856,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.jpmorganchase.com",
    "description": "JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. The company offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. It also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund services, liquidity, and trading services, and data solutions product",
    "cached_at": "2025-08-25T15:01:37.027725"
  },
  "JNJ": {
    "symbol": "JNJ",
    "name": "Johnson & Johnson",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "market_cap": 429671940096,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.jnj.com",
    "description": "Johnson & Johnson, together with its subsidiaries, engages in the research and development, manufacture, and sale of various products in the healthcare field worldwide. It operates in two segments, Innovative Medicine and MedTech. The Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. The MedTech segment provides electrophysiology products to treat heart rhythm di",
    "cached_at": "2025-08-25T15:01:37.076631"
  },
  "V": {
    "symbol": "V",
    "name": "Visa Inc.",
    "sector": "Financial Services",
    "industry": "Credit Services",
    "market_cap": 677038718976,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.visa.com",
    "description": "Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling",
    "cached_at": "2025-08-25T15:01:37.176104"
  },
  "PG": {
    "symbol": "PG",
    "name": "The Procter & Gamble Company",
    "sector": "Consumer Defensive",
    "industry": "Household & Personal Products",
    "market_cap": 365761069056,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.pginvestor.com",
    "description": "The Procter & Gamble Company provides branded consumer packaged goods worldwide. It operates through Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care segments. The company offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; antiperspirants, deodorants, and personal cleansing products under the Native, Old Spice, Safeguard, and Secret brands; and facial moisturizers, cleaners, and treatments under the Olay and SK-II brands. It also provides blades, razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brands. In addition, the company offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brands; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins/minerals/supplements, and other personal health care products under the Metamucil, Neurobion, Pepto-Bismol, and Vicks brand",
    "cached_at": "2025-08-25T15:01:37.448945"
  },
  "UNH": {
    "symbol": "UNH",
    "name": "UnitedHealth Group Incorporated",
    "sector": "Healthcare",
    "industry": "Healthcare Plans",
    "market_cap": 276103757824,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.unitedhealthgroup.com",
    "description": "UnitedHealth Group Incorporated operates as a health care company in the United States and internationally. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older; Medicaid plans, children's health insurance and health care programs; and health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. ",
    "cached_at": "2025-08-25T15:01:37.628361"
  },
  "HD": {
    "symbol": "HD",
    "name": "The Home Depot, Inc.",
    "sector": "Consumer Cyclical",
    "industry": "Home Improvement Retail",
    "market_cap": 406826057728,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.homedepot.com",
    "description": "The Home Depot, Inc. operates as a home improvement retailer in the United States and internationally. It sells various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products. The company also offers installation services for flooring, water heaters, baths, garage doors, cabinets, cabinet makeovers, countertops, sheds, furnaces and central air systems, and windows. In addition, it provides tool and equipment rental services. The company serves consumers, such as do-it-yourself homeowners and do-it-for-me customers; and professional renovators/remodelers, general contractors, small to medium homebuilders, maintenance professionals, handymen, property managers, building service contractors and specialty tradespeople, such as electricians, landscapers, plumbers, painters, pool contractors, and roofers. It sells its products through websites and its mobile applications, including homede",
    "cached_at": "2025-08-25T15:01:37.644164"
  },
  "MA": {
    "symbol": "MA",
    "name": "Mastercard Incorporated",
    "sector": "Financial Services",
    "industry": "Credit Services",
    "market_cap": 536268996608,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.mastercard.com",
    "description": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; consumer bill payment services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; and a platform to optimize supplier payment enablement campaigns for financial ins",
    "cached_at": "2025-08-25T15:01:37.645927"
  },
  "DIS": {
    "symbol": "DIS",
    "name": "The Walt Disney Company",
    "sector": "Communication Services",
    "industry": "Entertainment",
    "market_cap": 211634339840,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://thewaltdisneycompany.com",
    "description": "The Walt Disney Company operates as an entertainment company in the Americas, Europe, and the Asia Pacific. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, and Hulu; sports-related video streaming content through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale/licensing of film and episodic content to television and video-on-demand services; theatrical, home entertainment, and music distribution serv",
    "cached_at": "2025-08-25T15:01:37.742103"
  },
  "BAC": {
    "symbol": "BAC",
    "name": "Bank of America Corporation",
    "sector": "Financial Services",
    "industry": "Banks - Diversified",
    "market_cap": 366495891456,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.bankofamerica.com",
    "description": "Bank of America Corporation, through its subsidiaries, provides various financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. The company operates through four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, checking accounts, and investment accounts and products; credit and debit cards; residential mortgages and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and",
    "cached_at": "2025-08-25T15:01:38.080949"
  },
  "PYPL": {
    "symbol": "PYPL",
    "name": "PayPal Holdings, Inc.",
    "sector": "Financial Services",
    "industry": "Credit Services",
    "market_cap": 66379665408,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.paypal.com",
    "description": "PayPal Holdings, Inc. operates a technology platform that enables digital payments for merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, consumer credit products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.",
    "cached_at": "2025-08-25T15:01:38.194370"
  },
  "ADBE": {
    "symbol": "ADBE",
    "name": "Adobe Inc.",
    "sector": "Technology",
    "industry": "Software - Application",
    "market_cap": 154073677824,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.adobe.com",
    "description": "Adobe Inc., together with its subsidiaries, operates as a technology company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products and services that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows subscribers to use its creative products and applications (apps) integrated with cloud-delivered services across various surfaces and platforms. This segment serves photographers, video editors, graphic and experience designers, and game developers; content creators, students, marketers, and knowledge workers; and consumers. The Digital Experience segment provides an integrated platform and set of products, services, and solutions that enable brands and businesses to create, manage, execute, measure, monetize, and optimize",
    "cached_at": "2025-08-25T15:01:38.210934"
  },
  "NFLX": {
    "symbol": "NFLX",
    "name": "Netflix, Inc.",
    "sector": "Communication Services",
    "industry": "Entertainment",
    "market_cap": 517589598208,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.netflix.com",
    "description": "Netflix, Inc. provides entertainment services. The company offers television (TV) series, documentaries, feature films, and games across various genres and languages. It also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. The company operates approximately in 190 countries. Netflix, Inc. was incorporated in 1997 and is headquartered in Los Gatos, California.",
    "cached_at": "2025-08-25T15:01:38.263185"
  },
  "CRM": {
    "symbol": "CRM",
    "name": "Salesforce, Inc.",
    "sector": "Technology",
    "industry": "Software - Application",
    "market_cap": 236963708928,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.salesforce.com",
    "description": "Salesforce, Inc. provides customer relationship management (CRM) technology that connects companies and customers together worldwide. The company offers Agentforce, an agentic layer of the salesforce platform; Data Cloud, a data engine; Industries AI for creating industry-specific AI agents with Agentforce ; Salesforce Starter, a suite of solution for small and medium-size business; Slack, a workplace communication and productivity platform; Tableau, an end-to-end analytics solution for range of enterprise use cases and intelligent analytics with AI models, spot trends, predict outcomes, timely recommendations, and take action from any device; and integration and analytics solutions. It also provides marketing platform; commerce services, which empowers shopping experience across various customer touchpoint; and field service solution that enables companies to connect service agents, dispatchers, and mobile employees through one centralized platform to schedule and dispatch work, as we",
    "cached_at": "2025-08-25T15:01:38.359268"
  },
  "PFE": {
    "symbol": "PFE",
    "name": "Pfizer Inc.",
    "sector": "Healthcare",
    "industry": "Drug Manufacturers - General",
    "market_cap": 142934720512,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.pfizer.com",
    "description": "Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular and migraine under the Eliquis, Nurtec ODT/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infect",
    "cached_at": "2025-08-25T15:01:38.680098"
  },
  "TMO": {
    "symbol": "TMO",
    "name": "Thermo Fisher Scientific Inc.",
    "sector": "Healthcare",
    "industry": "Diagnostics & Research",
    "market_cap": 185313083392,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.thermofisher.com",
    "description": "Thermo Fisher Scientific Inc. provides life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and biopharma services in the North America, Europe, Asia-Pacific, and internationally. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery and production of drugs and vaccines, as well as diagnosis of infections and diseases. Its Analytical Instruments segment provides instruments, consumables, software, and services for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment includes clinical diagnostics offering liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, protein detection assays, and instruments; immunodiagnostics offers develops, manufactures, and markets complete blood test",
    "cached_at": "2025-08-25T15:01:38.756979"
  },
  "NKE": {
    "symbol": "NKE",
    "name": "NIKE, Inc.",
    "sector": "Consumer Cyclical",
    "industry": "Footwear & Accessories",
    "market_cap": 116926169088,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.nike.com",
    "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic and casual footwear, apparel, equipment, accessories, and services for men, women, and kids in North America, Europe, the Middle East, Africa, Greater China, the Asia Pacific, and Latin America. The company offers its products under the NIKE, Jordan, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also provides a line of performance equipment and accessories, including bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities, as well as various plastic products to other manufacturers; distributes and licenses casual sneakers, apparel, and accessories; and markets apparel with licensed college and professional team and league logos. In addition, the company offers consumer services and experiences, including sport focused events and activations; fitness and activi",
    "cached_at": "2025-08-25T15:01:38.847804"
  },
  "WMT": {
    "symbol": "WMT",
    "name": "Walmart Inc.",
    "sector": "Consumer Defensive",
    "industry": "Discount Stores",
    "market_cap": 766678925312,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://corporate.walmart.com",
    "description": "Walmart Inc. engages in the operation of retail and wholesale stores and clubs, eCommerce websites, and mobile applications worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; and ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites. The company also offers grocery items, including dry grocery, snacks, dairy, meat, produce, deli and bakery, frozen foods, alcoholic and nonalcoholic beverages, as well as consumables, such as health and beauty aids, pet supplies, household chemicals, paper goods, and baby products; and fuel and other categories. In addition, it is involved in the provision of health and wellness products covering pharmacy, optical and hearing services, over-the-counter drugs, and protein and ",
    "cached_at": "2025-08-25T15:01:38.976575"
  },
  "ABT": {
    "symbol": "ABT",
    "name": "Abbott Laboratories",
    "sector": "Healthcare",
    "industry": "Medical Devices",
    "market_cap": 229514461184,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.abbott.com",
    "description": "Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, hypertriglyceridemia, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion serology testing; molecular diagnostics polymerase chain reaction instrument s",
    "cached_at": "2025-08-25T15:01:39.041540"
  },
  "CVX": {
    "symbol": "CVX",
    "name": "Chevron Corporation",
    "sector": "Energy",
    "industry": "Oil & Gas Integrated",
    "market_cap": 318744526848,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.chevron.com",
    "description": "Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment engages in the exploration, development, production, and transportation of crude oil and natural gas; liquefaction, transportation, and regasification of liquefied natural gas; transporting crude oil through pipelines; processing, transporting, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels; transports crude oil and refined products through pipeline, marine vessel, motor equipment, and rail car; and manufactures and markets commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives. The company was formerly known a",
    "cached_at": "2025-08-25T15:01:39.275998"
  },
  "KO": {
    "symbol": "KO",
    "name": "The Coca-Cola Company",
    "sector": "Consumer Defensive",
    "industry": "Beverages - Non-Alcoholic",
    "market_cap": 296651948032,
    "country": "United States",
    "exchange": "NYQ",
    "currency": "USD",
    "website": "https://www.coca-colacompany.com",
    "description": "The Coca-Cola Company, a beverage company, manufactures and sells various nonalcoholic beverages in the United States and internationally. The company provides sparkling soft drinks and flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers comprising restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Crystal, Dasani, dogadan, Fuze Tea, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, I LOHAS, Powerade, Topo Chico, Core Power, Del Valle, fairlife, innocent, Maaza, Minute Maid, Minute Maid ",
    "cached_at": "2025-08-25T15:01:39.328953"
  },
  "PEP": {
    "symbol": "PEP",
    "name": "PepsiCo, Inc.",
    "sector": "Consumer Defensive",
    "industry": "Beverages - Non-Alcoholic",
    "market_cap": 202897653760,
    "country": "United States",
    "exchange": "NMS",
    "currency": "USD",
    "website": "https://www.pepsico.com",
    "description": "PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Q",
    "cached_at": "2025-08-25T15:01:39.410150"
  }
}